## Import Libraries for Analysis

In [24]:
# Import Core Libraries
import os
import sys
import time
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Set Theme for graphs
sns.set_theme(palette='bright')

### Self-Made Functions

In [25]:
def infoOut(data):
    '''
    Title: Display Dataframe of df.info
    Description: Display a pandas dataframe of df.info

    data: Pandas dataframe.
    '''
    dfInfo = data.columns.to_frame(name='Column')   # Create dataframe         
    dfInfo['Non-Null Count'] = data.notna().sum()   # Add non-null counts to dataframe
    dfInfo['NULL Count'] = data.isnull().sum()      # Add NULL counts to dataframe        
    dfInfo['Dtype'] = data.dtypes                   # add dtype to dataframe
    dfInfo.reset_index(drop=True,inplace=True)      # Reset index        
    return dfInfo                                   # display info dataframe

def nullValues(data):
    '''
    Title: Display Null values in Pandas Dataframe
    Description: Display a pandas dataframe of Null values for each column
    
    data: Pandas dataframe.
    '''
    display(data.isnull().sum().to_frame().rename(columns = {0:'NULL Amounts'}))

## Data Overview

In [51]:
# Create DataFrame to Hold data
stl_county_df = pd.read_csv('STL-County-2023.csv', low_memory=False)
stl_city_df = pd.read_csv('STL-City-2023.csv', low_memory=False)
stl_census_df = pd.read_csv('STL-Census-2023.csv', low_memory=False)

# Show DataFrame Head
print('St.Louis County')
print('-' * 20)
display(stl_county_df.head(3))

# Show DataFrame Head
print('\n\n\nSt. Louis City')
print('-' * 20)
display(stl_city_df.head(3))

# Show Census Data
print('\n\nSt.Louis Census')
print('-'*20)
display(stl_census_df.head(3))

St.Louis County
--------------------

,OffenseName,OffenseCategory,Report Number,reportingJuris,forJuris,address,latitude,longitude,dtCalledIntoCad,occurred,OccDOW,OccMonth,premise,zone,district
0,Destruction/Damage/Vandalism Of Property,Property,3-431,RICHMOND HEIGHTS,RICHMOND HEIGHTS,1107 EAST LINDEN,38.633600,-90.342300,2/27/2023 18:08,2/26/2003,Wed,2,CHURCH,3212,DISTRICT 3
1,Destruction/Damage/Vandalism Of Property,Property,23-1,MOLINE ACRES,MOLINE ACRES,2352 GARDNER DR,38.749906,-90.247051,1/1/2023 0:04,1/1/2023,Sun,1,RESIDENCE,1133,NaN
2,Destruction/Damage/Vandalism Of Property,Property,23-1,LAKESHIRE,LAKESHIRE,10080 SQUIRE MEADOWS DR,38.536756,-90.341975,1/2/2023 11:31,1/2/2023,Mon,1,APARTMENT PARKING LOT,3422,NaN

St. Louis City
--------------------

,inci_id,date_inc,time_inc,offense,nibrs_grp,nibrs_code,beat,district,neighborhood,latitude,longitude,incidentlocation,locationStreet2_Apt,city,state,zip
0,23000004,2023-01-01,21:00.0,UNLAWFUL USE OF WEAPON - SUBSECTION 3 - DISCHA...,A,520,524,5.0,38,38.646434,-90.26485,2 PORTLAND PL,NaN,Saint Louis,MO,NaN
1,23000004,2023-01-01,21:00.0,PROPERTY DAMAGE - 2ND DEGREE,A,290,524,5.0,38,38.646434,-90.26485,2 PORTLAND PL,NaN,Saint Louis,MO,NaN
2,23000007,2023-01-01,10:00.0,ASSAULT 1ST DEGREE OR ATTEMPT,A,13A,425,4.0,60,38.652984,-90.20108,3001 N FLORISSANT AVE,NaN,Saint Louis,MO,NaN

St.Louis Census
--------------------

,Fact,St.Louis County,St.Louis City
0,"Population estimates, July 1, 2023, (V2023)",NaN,NaN
1,"Population Estimates, July 1, 2022, (V2022)","990,414","286,578"
2,"Population estimates base, April 1, 2020, (V2023)",NaN,NaN

### Data Information

In [50]:
### Data Information
# Show St.Louis County
print('St.Louis County')
print('-' * 20)
display(infoOut(stl_county_df))

# Show St.Louis City
print('\n\n\nSt. Louis City')
print('-' * 20)
display(infoOut(stl_city_df))

# Show St.Louis Census Data
print('\n\nSt.Louis Census')
print('-'*20)
display(infoOut(stl_census_df))

St.Louis County
--------------------

             Column  Non-Null Count  NULL Count    Dtype
0       OffenseName           35140           0   object
1   OffenseCategory           35140           0   object
2     Report Number           35140           0   object
3    reportingJuris           35140           0   object
4          forJuris           35140           0   object
5           address           34681         459   object
6          latitude           34681         459  float64
7         longitude           34681         459  float64
8   dtCalledIntoCad           35140           0   object
9          occurred           35140           0   object
10           OccDOW           35140           0   object
11         OccMonth           35140           0    int64
12          premise           35140           0   object
13             zone           35140           0   object
14         district           28438        6702   object

St. Louis City
--------------------

                 Column  Non-Null Count  NULL Count    Dtype
0               inci_id           56532           0    int64
1              date_inc           56532           0   object
2              time_inc           56532           0   object
3               offense           56532           0   object
4             nibrs_grp           56531           1   object
5            nibrs_code           56532           0   object
6                  beat           56532           0   object
7              district           56532           0  float64
8          neighborhood           56532           0   object
9              latitude           56266         266  float64
10            longitude           56266         266  float64
11     incidentlocation           56532           0   object
12  locationStreet2_Apt            9637       46895   object
13                 city           56532           0   object
14                state           56532           0   object
15                  zip           22146       34386   object

St.Louis Census
--------------------

            Column  Non-Null Count  NULL Count   Dtype
0             Fact              66           0  object
1  St.Louis County              63           3  object
2    St.Louis City              63           3  object

### Map NIBRS Code for Offense Code

In [33]:
nibrs_code_maps = {'200':'Arson', 
                   '13A':'Aggravated Assault',
                   }

array(['Property', 'Society', 'Person'], dtype=object)

### Convert Column Formats

### Null Values